# Chapter 8

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(np.random.randn(9),index =[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1,2,3,1,3,1,2,2,3]])

In [3]:
data

a  1    1.324397
   2    0.417286
   3    0.082290
b  1    1.645109
   3   -0.375050
c  1   -0.759091
   2    0.291331
d  2   -0.164486
   3   -0.009598
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b']

1    1.645109
3   -0.375050
dtype: float64

In [6]:
data['b':'c']

b  1    1.645109
   3   -0.375050
c  1   -0.759091
   2    0.291331
dtype: float64

In [7]:
data.loc[['b','d']]

b  1    1.645109
   3   -0.375050
d  2   -0.164486
   3   -0.009598
dtype: float64

In [8]:
data.loc[:,2]

a    0.417286
c    0.291331
d   -0.164486
dtype: float64

In [9]:
data.unstack()

          1         2         3
a  1.324397  0.417286  0.082290
b  1.645109       NaN -0.375050
c -0.759091  0.291331       NaN
d       NaN -0.164486 -0.009598

In [10]:
data.unstack().stack()

a  1    1.324397
   2    0.417286
   3    0.082290
b  1    1.645109
   3   -0.375050
c  1   -0.759091
   2    0.291331
d  2   -0.164486
   3   -0.009598
dtype: float64

In [11]:
frame =pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'],[1,2,1,2]], columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])

In [12]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names=['key1','key2']

In [14]:
frame.columns.names=['state','color']

In [15]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [17]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],names=['state', 'color'])

NameError: name 'MultiIndex' is not defined

In [18]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [19]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [20]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [21]:
frame.sum(level='key2')

/var/folders/1s/yqryqhms0kz8vy_c_806zj7w0000gp/T/ipykernel_2216/2004046222.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [22]:
frame.sum(level='color',axis=1)

/var/folders/1s/yqryqhms0kz8vy_c_806zj7w0000gp/T/ipykernel_2216/1534194635.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [24]:
frame= pd.DataFrame({'a': range(7), 'b': range(7, 0, -1), 'c': ['one', 'one', 'one', 'two', 'two',
'two', 'two'], 'd':[0,1,2,0,1,2,3]})

In [25]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [26]:
frame2 = frame.set_index(['c','d'])

In [27]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [28]:
frame.set_index(['c','d'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [29]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [30]:
df1= pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [31]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [32]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [33]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [34]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [35]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [36]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [37]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [38]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [39]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [42]:
df1 = pd.DataFrame({'key': ['b','b','a','c','a','b'],'data1': range(6)})

In [43]:
df2 =pd.DataFrame({'key': ['a','b','a','b','d'], 'data2':range(5)})

In [44]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [45]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [46]:
pd.merge(df1,df2, on ='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [47]:
pd.merge(df1, df2, how ='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [48]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

In [50]:
right = pd.DataFrame({'key1':['foo','foo','bar','bar'], 'key2':['one','one','one','two'],'rval': [4,5,6,7]})

In [51]:
pd.merge(left, right, on=['key1','key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [52]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [53]:
pd.merge(left, right, on ='key1', suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [54]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'], 'value':range(6)})

In [55]:
right1= pd.DataFrame({'group_val': [3.5,7]}, index =['a','b'])

In [56]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [57]:
right1

   group_val
a        3.5
b        7.0

In [58]:
pd.merge(left1, right1, left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [59]:
pd.merge(left1, right1, left_on='key', right_index =True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [60]:
lefth= pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada','Nevada'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})

In [62]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)), index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],[2001, 2000, 2000, 2000, 2001, 2002]], columns=['event1','event2'])

In [63]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [64]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [65]:
pd.merge(lefth, righth, left_on=['key1','key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [66]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [67]:
left2 =pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])

In [68]:
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]], index =['b','c','d','e'], columns =['Missouri','Alabama'])

In [69]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [70]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [71]:
pd.merge(left2, right2, how='outer',left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [72]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [73]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [74]:
another= pd.DataFrame([[7.,8.], [9.,10.],[11.,12.],[16.,17.]], index=['a','c','e','f'], columns=['New York','Oregon'])

In [75]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [76]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [77]:
left2.join([right2,another],how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [78]:
arr = np.arange(12).reshape((3,4))

In [79]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [80]:
np.concatenate([arr,arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [81]:
s1 = pd.Series([0,1], index=['a','b'])

In [82]:
s2 = pd.Series([2,3,4], index=['c','d','e'])

In [83]:
s3 = pd.Series([5,6],index=['f','g'])

In [84]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [85]:
s4 = pd.concat([s1,s3])

In [86]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [87]:
pd.concat([s1,s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [88]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  1

In [90]:
 pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [91]:
result= pd.concat([s1,s1,s3],keys=['one','two','three'])

In [92]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [93]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [94]:
pd.concat([s1,s2,s3],axis=1, keys=['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

df1 =pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])

df2 = pd.DataFrame(5+ np.arange(4).reshape(2,2), index['a','c'], columns=['three','four])

In [95]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [96]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [97]:
pd.concat([df1,df2],axis=1, keys=['level1','level2'])

  level1       level2
     key data1    key data2
0      b     0      a   0.0
1      b     1      b   1.0
2      a     2      a   2.0
3      c     3      b   3.0
4      a     4      d   4.0
5      b     5    NaN   NaN

In [98]:
pd.concat({'level1': df1,'level2':df2}, axis=1)

  level1       level2
     key data1    key data2
0      b     0      a   0.0
1      b     1      b   1.0
2      a     2      a   2.0
3      c     3      b   3.0
4      a     4      d   4.0
5      b     5    NaN   NaN

In [99]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'], names=['upper','lower'])

upper level1       level2
lower    key data1    key data2
0          b     0      a   0.0
1          b     1      b   1.0
2          a     2      a   2.0
3          c     3      b   3.0
4          a     4      d   4.0
5          b     5    NaN   NaN

In [100]:
df1= pd.DataFrame(np.random.randn(3,4), columns=['a','b','c','d'])

In [101]:
df2 = pd.DataFrame(np.random.randn(2,3), columns=['b','d','a'])

In [102]:
df1

          a         b         c         d
0  0.187714  1.286281 -0.512487  0.520961
1  0.508279 -0.368427  1.807095 -1.913601
2 -1.970794 -0.467359  1.225475  0.448815

In [103]:
df2

          b         d         a
0  0.403599 -0.325930 -0.618968
1  0.143448  0.082551 -0.743779

In [104]:
pd.concat([df1, df2],ignore_index=True)

          a         b         c         d
0  0.187714  1.286281 -0.512487  0.520961
1  0.508279 -0.368427  1.807095 -1.913601
2 -1.970794 -0.467359  1.225475  0.448815
3 -0.618968  0.403599       NaN -0.325930
4 -0.743779  0.143448       NaN  0.082551

In [105]:
a = pd.Series([np.nan, 2.5,np.nan,3.5,4.5, np.nan],index=['f','e','d','c','b','a'])

In [106]:
b = pd.Series(np.arange(len(a), dtype=np.float64), index =['f','e','d','c','b','a'])

In [107]:
b[-1]=np.nan

In [108]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [109]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [110]:
np.where(pd.isnull(a),b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [111]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [112]:
df1= pd.DataFrame ({'a':[1., np.nan,5., np.nan], 'b': [np.nan, 2., np.nan,6.],'c': range(2,18,4)})

In [113]:
df2= pd.DataFrame({'a':[5.,4.,np.nan,3.,7.],'b':[np.nan,3.,4.,6.,8.]})

In [114]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [115]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [116]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [117]:
data = pd.DataFrame(np.arange(6).reshape((2,3)), index=pd.Index(['Ohio','Colorado'], name= 'state'), columns=pd.Index(['one','two','three'],name='number'))

In [118]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [119]:
result = data.stack()

In [120]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [121]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [122]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [123]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [124]:
s1 = pd.Series([0,1,2,3],index=['a','b','c','d'])

In [125]:
s2= pd.Series([4,5,6], index=['c','d','e'])

In [126]:
data2 = pd.concat([s1,s2], keys=['one','two'])

In [127]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [128]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [129]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [130]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [131]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [132]:
df= pd.DataFrame({'left': result,' right':result + 5}, columns =pd.Index(['left','right'],name ='side'))

In [133]:
df

side             left right
state    number
Ohio     one        0   NaN
         two        1   NaN
         three      2   NaN
Colorado one        3   NaN
         two        4   NaN
         three      5   NaN

In [134]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3   NaN      NaN
two       1        4   NaN      NaN
three     2        5   NaN      NaN

In [135]:
df.unstack('state').stack('side')

state       Colorado Ohio
number side
one    left        3    0
two    left        4    1
three  left        5    2

In [136]:
data = pd.read_csv('examples/macrodata.csv')

In [137]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [139]:
periods= pd.PeriodIndex(year=data.year, quarter =data.quarter, name= 'data')

In [140]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [141]:
data = data.reindex(columns = columns)

In [142]:
data.index= periods.to_timestamp('D','end')

In [143]:
ldata = data.stack().reset_index().rename(columns={0:'value'})

In [144]:
ldata[:10]

                           data     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [146]:
pivoted = ldata.pivot('date', 'item', 'value')

KeyError: 'date'

In [147]:
pivoted

NameError: name 'pivoted' is not defined

In [148]:
ldata['value2']=np.random.randn(len(ldata))

In [149]:
ldata[:10]

                           data     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349 -0.710775
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.705829
2 1959-03-31 23:59:59.999999999    unemp     5.800 -0.184402
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.015285
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.056229
5 1959-06-30 23:59:59.999999999    unemp     5.100  0.998354
6 1959-09-30 23:59:59.999999999  realgdp  2775.488  4.002645
7 1959-09-30 23:59:59.999999999     infl     2.740 -1.156309
8 1959-09-30 23:59:59.999999999    unemp     5.300 -0.288231
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  0.039920

In [150]:
pivoted= ldata.pivot('date','item')

KeyError: "None of ['date'] are in the columns"

In [151]:
pivoted['value'][:5]

NameError: name 'pivoted' is not defined

In [152]:
unstacked =ldata.set_index(['date','item']).unstack('item')

KeyError: "None of ['date'] are in the columns"

In [153]:
unstacked[:7]

NameError: name 'unstacked' is not defined

In [154]:
df =pd.DataFrame({'key':['foo','bar','baz'],'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})

In [155]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [156]:
melted = pd.melt(df,['key'])

In [157]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [158]:
reshaped =melted.pivot('key','variable','value')

In [159]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [160]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [161]:
pd.melt(df, id_vars=['key'],value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [162]:
pd.melt(df, value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [163]:
pd.melt(df, value_vars =['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6